# Install homebrew packages with brew bundle

# Buildkite configuration
tap "buildkite/cli"
brew "bk"
tap "buildkite/buildkite"
brew "buildkite-agent"

# MacOS preferences
tap "clintmod/formulas"
brew "macprefs"

brew "bash"
brew "carthage"
brew "composer"
brew "curl"
brew "docker-compose"
brew "git"
brew "go"
brew "gradle"
brew "grep"
brew "grpcurl"
brew "htop"
brew "influxdb"
brew "iperf"
brew "ipython"
brew "jq"
brew "jsonpp"
brew "maven"
brew "netcat"
brew "nmap"
brew "node"
brew "npm"
brew "p7zip"
brew "pact-ruby-standalone"
brew "perl"
brew "postgresql"
brew "protobuf"
brew "pv"
brew "python"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "sqlite"
brew "swift"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
